app/views/posts/index.html.erb

		<strong>Content:</strong> <%= post.body %><br>
		<strong>Author:</strong>  <%= User.find(post.user_id).name %><br>
		<strong>Number of comments:</strong> <%= post.comments.count %><br>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]