app/views/posts/show.html.erb


<p>Author: <%= User.find(@post.user_id).name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]