app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    if session[:user_id]
      @user = User.find(session[:user_id])
    end
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    if (@post = Post.find_by_id(params[:id])).present?

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "siudkfshd"], ["body", "jhkesjfksdsefdsdf"], ["created_at", "2024-11-03 02:39:25.687029"], ["updated_at", "2024-11-03 02:39:25.687029"], ["user_id", 7]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "sadasd"], ["body", "asdasdasda"], ["created_at", "2024-11-03 00:38:48.695451"], ["updated_at", "2024-11-03 00:38:48.695451"], ["user_id", 1]]
---
  def create
    @author = User.find_by_id(session[:user_id])
    @post = @author.posts.create(post_params)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    @post = Post.find(params[:id])
    if @current_user.id != @post.user_id
      redirect_to post_path(@post)
    else
      @post.destroy