app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if User.where(:name => @user.name).exists?
      @existing_user = User.find_by_name(@user.name)
      session[:user_id] = @existing_user.id
      redirect_to root_path
    else
      if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "sarah"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "sarah"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "sarah"], ["created_at", "2024-11-03 03:45:19.549011"], ["updated_at", "2024-11-03 03:45:19.549011"]]